#include <iostream>
#include <conio.h>
#include <map>
#include <iomanip>

using namespace std;

map<string, map<string, double>> conversionTable = {
    {"distance", {
        {"миллиметр", 1000},        // Миллиметр = 1/1000 метра
        {"сантиметр", 100},         // Сантиметр = 1/100 метра
        {"метр", 1},                // Метр = 1 метра
        {"километр", 0.001},        // Километр = 1000 метров
        {"дюйм", 39.3701},          // Дюйм = 1/39.3701 метра
        {"фут", 3.28084},           // Фут = 1/3.28084 метра
        {"миля", 0.000621371},      // Миля = 1609.34 метра
        {"морская миля", 0.000539957} // Морская миля = 1852 метра
    }},
    {"mass", {
        {"грамм", 1000},            // Грамм = 1/1000 килограмма
        {"килограмм", 1},           // Килограмм = 1 килограмма
        {"тонна", 0.001},           // Тонна = 1000 килограмм
        {"унция", 35.274},          // Унция = 1/35.274 килограмма
        {"фунт", 2.20462}           // Фунт = 1/2.20462 килограмма
    }},
    {"speed", {
        {"метр в секунду", 1},             // Метр в секунду = 1 метр в секунду
        {"метр в минуту", 60},             // Метр в минуту = 60 метров в минуту
        {"километр в секунду", 0.001},     // Километр в секунду = 1/1000 километра в секунду
        {"километр в час", 3.6},          // Километр в час = 3.6 километра в час
        {"миля в секунду", 0.000621371},  // Миля в секунду = 1/1609.34 мили в секунду
        {"миля в час", 2.23694},          // Миля в час = 1.60934 километра в час
        {"фут в секунду", 3.28084},       // Фут в секунду = 1/0.3048 фута в секунду
        {"фут в минуту", 196.85},         // Фут в минуту = 1/0.3048 * 60 футов в минуту
        {"узел", 1.94384},                // Узел = 1.94384 морских мили в час
        {"миля в час", 1.15078}           // Миля в час = 0.868976 узлов
    }}
};

void ConverterMenu() {
    cout << "Выбранный вариант: Конвертер единиц измерения: Программа, конвертирующая значения между различными единицами измерения (например, длина, вес, объем).\n\n";
    cout << "1. Конвертер расстояния\n2. Конвертер массы\n3. Конвертер скорости\n\n";
    cout << "Выберите раздел (или нажмите Esc для выхода): ";
}

void Converter() {
    system("cls");
    ConverterMenu();
    char choice;
    bool running = true;
    while (running) {
        choice = _getch();
        switch (choice) {
        case '1': {
            system("cls");

            _getch();
            system("cls");
            ConverterMenu();
            break;
        }
        case '2': {
            system("cls");

            _getch();
            system("cls");
            ConverterMenu();
            break;
        }
        case '3': {
            system("cls");

            _getch();
            system("cls");
            ConverterMenu();
            break;
        }
        case 27: {
            running = false;
            break;
        }
        }
    }
}